{
  "about": {
    "title": "Über mich",
    "intro1": "Mit einem Hintergrund in Mediengestaltung und einem Blick für Struktur und Ästhetik entwickle ich Webanwendungen, die technisch durchdacht und visuell klar sind.",
    "intro2": "Ich liebe die Verbindung von Code und Design: sauberes HTML/CSS, performante Architekturen mit Angular und ein UI, das sich für Nutzer intuitiv und stimmig anfühlt.",
    "intro3": "Was mich antreibt, ist die Idee, aus Komplexität einfache und elegante Lösungen zu formen.",
    "claim": "Technologien verändern sich – mein Anspruch bleibt:",
    "slogans": [
      "„Ordnung im Code ist kein Luxus. Es ist Verantwortung.“",
      "„Code ist Kommunikation.“",
      "„Frontend ist mehr als Technik – es ist Beziehung zum Nutzer.“",
      "„Wenn Code fließt, folgt das Design von selbst.“",
      "„Frontend ist kein Klickziel – sondern Systemschnittstelle.“",
      "„Technik ist kein Stilmittel. Sie ist Verantwortung.“",
      "„Der Nutzer sieht’s nicht. Aber der nächste Entwickler schon.“",
      "„Mein Stack? HTML, CSS, TypeScript – und eine Prise Intuition.“",
      "„Daten fließen, Layouts folgen – der Rest ist Fokus.“"
    ],
    "alt": "Porträtfoto von Jonathan Michutta"
  },
  "nav": {
    "home": "Home",
    "about": "Über mich",
    "skills": "Tools",
    "projects": "Projekte",
    "feedbacks": "Referenzen",
    "contact": "Kontakt"
  },
  "imprint": {
    "title": "Impressum",
    "subtitle": "Angaben gemäß §5 TMG",
    "name": "Jonathan Michutta",
    "role": "Frontend Developer & Mediendesigner",
    "address": "(München – Adresse auf Anfrage)",
    "contactHeader": "Kontakt:",
    "email": "front-dev@jonathan-michutta.de",
    "website": "https://www.jonathan-michutta.de",
    "phone": "(Telefon auf Anfrage)",
    "responsibleHeader": "Verantwortlich für den Inhalt nach §55 Abs.2 RStV:",
    "copyrightHeader": "Urheberrecht:",
    "copyrightText": "Alle Inhalte dieser Website (Texte, Bilder, Grafiken, Logo und Code) unterliegen dem deutschen Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung oder Verwendung außerhalb der Grenzen des Urheberrechts bedarf der schriftlichen Zustimmung des Erstellers. Downloads und Kopien dieser Seite sind nur für den privaten, nicht kommerziellen Gebrauch gestattet.",
    "liabilityHeader": "Haftung für Inhalte:",
    "liabilityText": "Als Diensteanbieter bin ich gemäß §7 Abs.1 TMG für eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich. Nach §§8 bis 10 TMG bin ich jedoch nicht verpflichtet, übermittelte oder gespeicherte fremde Informationen zu überwachen oder nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen. Bei Bekanntwerden von entsprechenden Rechtsverletzungen werde ich diese Inhalte umgehend entfernen.",
    "designHeader": "Design & Umsetzung:",
    "designText": "Jonathan Michutta\nAlle Gestaltungselemente dieser Website – insbesondere Logo, Struktur und UI-Stil – wurden eigenständig entworfen und umgesetzt.",
    "iconNote": "Hinweis zu Icons:\nEinige der verwendeten Icons basieren auf Vorlagen, die im Rahmen meiner Fortbildung bei der Development Academy bereitgestellt wurden. Sie dienen ausschließlich zur Veranschaulichung der verwendeten Technologien und verfolgen keine kommerzielle Nutzung oder markenrechtliche Darstellung."
  },
  "privacy": {
    "headline": "Datenschutzerklärung",
    "intro": "Diese Datenschutzerklärung klärt Sie über die Art, den Umfang und Zweck der Verarbeitung von personenbezogenen Daten (nachfolgend kurz \"Daten\") innerhalb unseres Onlineangebotes und der mit ihm verbundenen Webseiten, Funktionen und Inhalte auf.",
    "responsible": {
      "title": "Verantwortlicher:",
      "name": "Jonathan Michutta",
      "location": "München, Deutschland",
      "email": "front-dev@jonathan-michutta.de"
    },
    "access": {
      "title": "Zugriffsdaten",
      "intro": "Beim Besuch dieser Website werden automatisch Daten erfasst:",
      "ip": "IP-Adresse",
      "date": "Datum und Uhrzeit der Anfrage",
      "browser": "Browsertyp und Betriebssystem",
      "pages": "Besuchte Seiten (URL)"
    },
    "usage": "Diese Daten werden ausschließlich zur Gewährleistung eines sicheren Betriebs und zur statistischen Auswertung genutzt. Eine Zusammenführung mit anderen Datenquellen erfolgt nicht.",
    "contact": "Wenn Sie mit mir per Formular Kontakt aufnehmen, werden Ihre Angaben (z.B. Name, E-Mail-Adresse, Nachricht) zwecks Bearbeitung Ihrer Anfrage gespeichert. Diese Daten gebe ich nicht ohne Ihre Einwilligung weiter.<br><br>Die Verarbeitung erfolgt auf Grundlage Ihrer Einwilligung gemäß Art. 6 Abs. 1 lit. a DSGVO. Sie können diese Einwilligung jederzeit formlos widerrufen, z.B. per E-Mail.",
    "honeypot": "Zum Schutz vor automatisierten Spam-Einträgen verwende ich ein sogenanntes Honeypot-Feld. Dieses Feld ist für normale Besucher unsichtbar und wird von Bots oft automatisch ausgefüllt. Solche Einsendungen werden automatisch verworfen und nicht gespeichert.",
    "deletion": "Die Daten werden ausschließlich zur Bearbeitung Ihrer Nachricht verwendet und danach gelöscht, sofern keine gesetzlichen Aufbewahrungspflichten bestehen.",
    "cookies": {
      "title": "Cookies:",
      "text": "Diese Website verwendet keine Cookies, die der Nutzerzustimmung bedürfen."
    },
    "legal": {
      "title": "Rechtsgrundlagen der Verarbeitung:",
      "text": "Die Verarbeitung erfolgt gemäß Art. 6 Abs. 1 lit. f DSGVO (berechtigtes Interesse an der sicheren Bereitstellung der Website) sowie Art. 6 Abs. 1 lit. a DSGVO (Einwilligung, z. B. bei Kontaktformular)."
    },
    "rights": {
      "title": "Ihre Rechte",
      "intro": "Sie haben das Recht:",
      "access": "Auskunft über Ihre gespeicherten Daten zu erhalten (Art. 15 DSGVO)",
      "correction": "Berichtigung unrichtiger Daten (Art. 16 DSGVO)",
      "deletion": "Löschung oder Einschränkung der Verarbeitung (Art. 17 & 18 DSGVO)",
      "objection": "Widerspruch gegen die Verarbeitung (Art. 21 DSGVO)",
      "complaint": "Beschwerde bei einer Aufsichtsbehörde einzureichen"
    },
    "storage": {
      "title": "Speicherdauer:",
      "text": "Personenbezogene Daten werden nur solange gespeichert, wie es für den jeweiligen Zweck erforderlich ist bzw. gesetzliche Aufbewahrungspflichten bestehen. Änderungen der Datenschutzerklärung: Ich behalte mir vor, diese Datenschutzerklärung bei Bedarf zu ändern, um sie an geänderte Rechtslagen oder Änderungen des Onlineangebots anzupassen."
    },
    "lastUpdate": "Stand: Juni 2025"
  },
  "contact": {
    "title": "Kontakt",
    "introHeadline": "Lass uns gemeinsam etwas aufbauen",
    "subHeadline": "Ein digitales Problem, das gelöst werden will?",
    "introText": "Ich freue mich über Anfragen – erzähl mir einfach, in welchem Bereich du Unterstützung brauchst.<br />Zeig mir dein Vorhaben – und ich zeige dir, wie ich mit klarem Code echten Mehrwert schaffen kann.<br /><br />Du suchst einen Frontend Developer?<br /><span>Melde dich!</span>",
    "nameError": "Bitte gib deinen Namen ein!",
    "emailError": "Bitte gib eine gültige E-Mail-Adresse ein.",
    "messageError": "Ups, da fehlt noch eine Nachricht.",
    "privacyText": "Ich habe die",
    "privacyLink": "Datenschutzerklärung",
    "privacyTextEnd": "gelesen und stimme der darin beschriebenen Verarbeitung meiner Daten zu.",
    "privacyWarning": "Datenschutz ist wichtig!",
    "sending": "Wird gesendet",
    "sent": "Gesendet!",
    "send": "Senden",
    "namePlaceholder": "Dein Name",
    "emailPlaceholder": "Deine Mail",
    "messagePlaceholder": "Deine Nachricht...",
    "nameLabel": "Dein vollständiger Name",
    "emailLabel": "Deine E-Mail-Adresse",
    "messageLabel": "Deine Nachricht",
    "sendIconAlt": "Senden-Symbol",
    "sendAriaLabel": "Nachricht absenden",
    "formDescription": "Kontaktformular zum Versenden einer Nachricht. Alle Felder sind erforderlich."
  },
  "tools": {
    "headline": "Tools",
    "textBox1": "Ich arbeite mit modernen Frontend-Technologien, um performante, strukturierte und wartbare Anwendungen zu entwickeln.<br><br>Mein Fokus liegt auf sauberem Code, modularer Architektur und einem UI, das sich intuitiv anfühlt.<br><br>Ich bin offen für neue Technologien und bilde mich regelmäßig weiter – denn gute Webentwicklung heißt für mich: mitdenken, mitwachsen und mitgestalten.",
    "missingHeadline": "Fehlt ein Tool?",
    "missingText": "Melde dich gern – ich freue mich darauf, mein Wissen gezielt zu erweitern."
  },
  "feedback": {
    "title": "Referenzen",
    "patrick": {
      "text": "Jon war immer mit vollem Einsatz dabei und offen für jede Aufgabe. Besonders schätzenswert fand ich, wie vielseitig er sich eingebracht hat – das hat die Zusammenarbeit nicht nur produktiv, sondern auch sehr angenehm gemacht. Der Austausch war dabei stets offen, herzlich und kollegial."
    },
    "stephanie": {
      "text": "Jonathan war ein sehr angenehmer Teamkollege, der durch seine ruhige, strukturierte Art viel Stabilität ins Team gebracht hat. Seine Stärken lagen vor allem im Bereich UI-Design, CSS und Angular-Logik. Besonders geschätzt habe ich, dass er immer mitgedacht hat und technische Zusammenhänge klar kommunizieren konnte."
    },
    "jennifer": {
      "text": "Jonathan war von Anfang an voll integriert und hat sich sowohl fachlich als auch menschlich super ins Team eingefügt. Der Austausch war unkompliziert, produktiv und von gegenseitiger Wertschätzung geprägt. Besonders beeindruckt hat mich, wie schnell er sich in komplexe Themen eingearbeitet hat und stets die Ruhe bewahrte."
    },
    "ha": {
      "text": "Jon hat sich als selbstständig, engagiert und lösungsorientiert erwiesen. Seine Medienkompetenz und sein kreativer Ansatz haben das Design und die Nutzererfahrung des Projekts deutlich bereichert. Mit seiner positiven Einstellung und seinem Einsatz war er eine echte Bereicherung für das Team."
    },
    "taher": {
      "text": "Ich hatte das Vergnügen, mit Jonathan an einem Website-Projekt zu arbeiten, und war beeindruckt von seiner Begeisterung fürs Coden. Er hat neue Konzepte schnell verstanden und sie zielsicher ins Projekt eingebracht. Ruhig, fokussiert und immer mit dem Ziel, gemeinsam gute Lösungen zu finden."
    }
  },
  "projects": {
    "title": "Projekte",
    "subtitle": "Auswahl meiner praktischen Projekte",
    "join": {
      "title": "Join",
      "description": "Task-Manager mit Drag & Drop",
      "dialogDescription": "Task-Manager inspiriert vom Kanban-System. Erstelle und organisiere Aufgaben per Drag & Drop, weise Nutzer und Kategorien zu."
    },
    "pokedex": {
      "title": "Pokedex",
      "description": "Interaktive App mit API-Daten",
      "dialogDescription": "Interaktive Pokédex-App mit Live-API-Daten. Zeigt Namen, Typen und Bilder – filterbar und durchsuchbar."
    },
    "elpollo": {
      "title": "El Pollo Loco",
      "description": "Gaming mit OOP",
      "dialogDescription": "Jump-, Run- und Wurfspiel mit objektorientierter Programmierung. Hilf Pepe, Münzen und Tabascosoße zu sammeln, um das verrückte Huhn zu besiegen."
    },
    "portfolio": {
      "title": "Portfolio",
      "description": "UI-Design & barrierefreies Web",
      "dialogDescription": "Modernes UI-Design trifft auf barrierefreien Code – mit Fokus auf Screenreader, Tastaturnavigation und klaren Strukturen."
    }
  },
  "footer": {
    "copyright": "© Code & Design von Jonathan Michutta 2025",
    "imprint": "Impressum",
    "privacy": "Datenschutzerklärung",
    "copied": "Kopiert",
    "email": "front-dev@jonathan-michutta.de",
    "copyAria": "E-Mail kopieren"
  },
  "landing": {
    "title": "Webentwickler (Frontend)",
    "subtitle": "& Mediengestalter",
    "copied": "Kopiert",
    "copyAria": "E-Mail-Adresse in Zwischenablage kopieren",
    "copyTooltip": "E-Mail-Adresse kopieren",
    "mailLabel": "E-Mail senden an Jonathan",
    "toolsLabel": "Technologien, die ich verwende",
    "menuToggleAria": "Menü anzeigen oder ausblenden"
  },
  "tools-alt-landing": {
    "api": {
      "alt": "API – Schnittstellenprogrammierung"
    },
    "javascript": {
      "alt": "JavaScript – Programmiersprache für Webentwicklung"
    },
    "html": {
      "alt": "HTML – Strukturierung von Webseiteninhalten"
    },
    "git": {
      "alt": "Git – Versionskontrollsystem für Code"
    },
    "scrum": {
      "alt": "Scrum – agiles Projektmanagement-Framework"
    },
    "css": {
      "alt": "CSS – Gestaltung und Layout von Webseiten"
    },
    "typescript": {
      "alt": "TypeScript – typisierte Erweiterung von JavaScript"
    },
    "firebase": {
      "alt": "Firebase – Backend-Plattform von Google"
    },
    "angular": {
      "alt": "Angular – Webframework für Frontend-Anwendungen"
    },
    "material": {
      "alt": "Material Design – Designsystem von Google"
    },
    "school": {
      "alt": "Lernen & kontinuierliche Weiterbildung"
    },
    "oop": {
      "alt": "Objektorientierte Programmierung"
    },
    "react": {
      "alt": "React – JavaScript-Bibliothek für UI-Komponenten"
    },
    "vue": {
      "alt": "Vue.js – progressives JavaScript-Framework"
    },
    "figma": {
      "alt": "Figma – Design- und Prototyping-Tool"
    },
    "photoshop": {
      "alt": "Adobe Photoshop – Bildbearbeitung und Grafikdesign"
    },
    "illustrator": {
      "alt": "Adobe Illustrator – Vektorgrafiken und Logos"
    },
    "indesign": {
      "alt": "Adobe InDesign – Layout für Print und Digital"
    },
    "access": {
      "alt": "Barrierefreie Webentwicklung"
    }
  },
  "links": {
    "github": "Besuche mein GitHub-Profil",
    "mail": "E-Mail an mich senden",
    "linkedin": "Profil auf LinkedIn öffnen"
  },
  "dialog": {
    "alt": {
      "close": "Dialog schließen",
      "previous": "Vorheriges Projekt",
      "next": "Nächstes Projekt",
      "github": "GitHub-Link für Projekt",
      "icon": "Icon für Projekt {{project}}",
      "live": "Live-Demo des Projekts aufrufen"
    }
  },
  "logo": {
    "alt": "Logo von Jonathan Michutta – Frontend Developer",
    "homeLabel": "Zur Startseite"
  },
  "orientation": {
    "warning": "Bitte drehe dein Gerät ins Hochformat, um die App zu nutzen."
  }
}