{
  "about": {
    "title": "About me",
    "intro1": "With a background in media design and an eye for structure and aesthetics, I develop web applications that are technically sound and visually clear.",
    "intro2": "I love the combination of code and design: clean HTML/CSS, performant Angular architectures, and a UI that feels intuitive and cohesive for users.",
    "intro3": "What drives me is the idea of turning complexity into simple and elegant solutions.",
    "claim": "Technologies change – my standard remains:",
    "slogans": [
      "“Clean code isn't a luxury – it's a responsibility.”",
      "“Code is communication.”",
      "“Frontend is more than tech – it’s user relationship.”",
      "“When code flows, design follows.”",
      "“Frontend isn't a click-goal – it’s a system interface.”",
      "“Tech isn’t a style – it’s accountability.”",
      "“The user doesn’t see it. But the next developer will.”",
      "“My stack? HTML, CSS, TypeScript – and a pinch of intuition.”",
      "“Data flows, layouts follow – the rest is focus.”"
    ],
    "alt": "Portrait photo of Jonathan Michutta"
  },
  "nav": {
    "home": "Home",
    "about": "About me",
    "skills": "Skills",
    "projects": "Projects",
    "feedbacks": "References",
    "contact": "Contact"
  },
  "imprint": {
    "title": "Imprint",
    "subtitle": "Information according to §5 TMG",
    "name": "Jonathan Michutta",
    "role": "Frontend Developer & Media Designer",
    "address": "(Munich – address on request)",
    "contactHeader": "Contact:",
    "email": "front-dev@jonathan-michutta.de",
    "website": "https://www.jonathan-michutta.de",
    "phone": "(Phone number on request)",
    "responsibleHeader": "Responsible for content according to §55 Abs.2 RStV:",
    "copyrightHeader": "Copyright:",
    "copyrightText": "All content on this website (texts, images, graphics, logo, and code) is subject to German copyright law. Reproduction, editing, distribution, or use beyond the scope of copyright law requires written permission from the creator. Downloads and copies of this site are permitted only for private, non-commercial use.",
    "liabilityHeader": "Liability for Content:",
    "liabilityText": "As a service provider, I am responsible for my own content on these pages according to §7 Abs.1 TMG and general laws. According to §§8 to 10 TMG, I am not obligated to monitor transmitted or stored third-party information or investigate circumstances indicating illegal activity. Upon becoming aware of such violations, I will remove the content immediately.",
    "designHeader": "Design & Implementation:",
    "designText": "Jonathan Michutta\nAll design elements of this website – especially logo, structure, and UI style – were independently designed and implemented.",
    "iconNote": "Note on icons:\nSome of the icons used are based on templates provided during my training at the Development Academy. They are used solely to illustrate the technologies and are not intended for commercial use or trademark representation."
  },
  "privacy": {
    "headline": "Privacy Policy",
    "intro": "This privacy policy informs you about the type, scope and purpose of the processing of personal data (hereinafter referred to as \"data\") within our online offering and the associated websites, functions and content.",
    "responsible": {
      "title": "Responsible party:",
      "name": "Jonathan Michutta",
      "location": "Munich, Germany",
      "email": "front-dev@jonathan-michutta.de"
    },
    "access": {
      "title": "Access Data",
      "intro": "When visiting this website, the following data is automatically collected:",
      "ip": "IP address",
      "date": "Date and time of the request",
      "browser": "Browser type and operating system",
      "pages": "Visited pages (URL)"
    },
    "usage": "This data is used exclusively to ensure the secure operation of the site and for statistical evaluation. No combination with other data sources takes place.",
    "contact": "If you contact me via form, your data (e.g. name, email address, message) will be stored for the purpose of processing your request. This data will not be passed on without your consent.<br><br>The processing is based on your consent according to Art. 6 (1) lit. a GDPR. You can revoke this consent at any time, for example by email.",
    "honeypot": "To protect against automated spam entries, I use a so-called honeypot field. This field is invisible to regular visitors and is often automatically filled in by bots. Such submissions are automatically discarded and not stored.",
    "deletion": "The data is used exclusively to process your message and will be deleted afterward, unless legal retention obligations exist.",
    "cookies": {
      "title": "Cookies:",
      "text": "This website does not use cookies that require user consent."
    },
    "legal": {
      "title": "Legal Basis of Processing:",
      "text": "Processing is carried out in accordance with Art. 6 (1) lit. f GDPR (legitimate interest in the secure provision of the website) and Art. 6 (1) lit. a GDPR (consent, e.g. for the contact form)."
    },
    "rights": {
      "title": "Your Rights",
      "intro": "You have the right to:",
      "access": "Request information about your stored data (Art. 15 GDPR)",
      "correction": "Request correction of inaccurate data (Art. 16 GDPR)",
      "deletion": "Request deletion or restriction of processing (Art. 17 & 18 GDPR)",
      "objection": "Object to processing (Art. 21 GDPR)",
      "complaint": "File a complaint with a supervisory authority"
    },
    "storage": {
      "title": "Storage Duration:",
      "text": "Personal data is stored only as long as necessary for the respective purpose or if legal retention obligations apply. I reserve the right to change this privacy policy if necessary to reflect changes in the law or in the online offering."
    },
    "lastUpdate": "Last updated: June 2025"
  },
  "contact": {
    "title": "Contact",
    "introHeadline": "Let’s build something together",
    "subHeadline": "A problem to solve?",
    "introText": "I’m happy to receive inquiries – just tell me which area you need support in.<br />Show me your project – and I’ll show you how I can create real value with clean code.<br /><br />Looking for a Frontend Developer?<br /><span>Get in touch!</span>",
    "nameError": "Please enter your name!",
    "emailError": "Please enter a valid email address.",
    "messageError": "Oops, something is missing!",
    "privacyText": "I have read the",
    "privacyTextEnd": "and I agree to the data processing described therein.",
    "privacyLink": "privacy policy",
    "privacyWarning": "Privacy matters!",
    "sending": "Sending",
    "sent": "Sent!",
    "send": "Send",
    "namePlaceholder": "Your name",
    "emailPlaceholder": "Your email",
    "messagePlaceholder": "Your message...",
    "nameLabel": "Your full name",
    "emailLabel": "Your email address",
    "messageLabel": "Your message",
    "sendIconAlt": "Send icon",
    "sendAriaLabel": "Send message",
    "formDescription": "Contact form to send a message. All fields are required."
  },
  "tools": {
    "headline": "Skills",
    "textBox1": "I work with modern frontend technologies to build performant, structured, and maintainable applications.<br><br>My focus lies on clean code, modular architecture, and a UI that feels intuitive.<br><br>I'm open to new technologies and regularly expand my knowledge – because good web development means thinking along, growing along, and helping shape the future.",
    "missingHeadline": "Missing a tool?",
    "missingText": "Feel free to reach out – I'm always happy to expand my skillset."
  },
  "feedback": {
    "title": "References",
    "patrick": {
      "text": "Jon was always fully committed and open to any task. What I especially appreciated was how versatile he contributed – it made the collaboration not only productive but also very pleasant. The exchange was always open, warm, and collegial."
    },
    "stephanie": {
      "text": "Jonathan was a very pleasant teammate who brought great stability to the team with his calm and structured manner. His strengths were especially in UI design, CSS, and Angular logic. I particularly valued how he always thought ahead and could clearly communicate technical contexts."
    },
    "jennifer": {
      "text": "Jonathan was fully integrated from the start and fit into the team both professionally and personally. The collaboration was easy, productive, and characterized by mutual appreciation. I was especially impressed by how quickly he dove into complex topics while staying calm at all times."
    },
    "ha": {
      "text": "Jon proved to be independent, committed, and solution-oriented. His media skills and creative approach significantly enriched the design and user experience of the project. With his positive attitude and dedication, he was truly an asset to the team."
    },
    "taher": {
      "text": "I had the pleasure of working with Jonathan on a website project and was impressed by his enthusiasm for coding. He quickly understood new concepts and purposefully integrated them into the project. Calm, focused, and always aiming to find good solutions together."
    }
  },
  "projects": {
    "title": "Projects",
    "subtitle": "Selection of my practical projects",
    "join": {
      "title": "Join",
      "description": "Task manager with drag & drop",
      "dialogDescription": "Task manager inspired by the Kanban system. Create and organize tasks via drag & drop, assign users and categories."
    },
    "pokedex": {
      "title": "Pokedex",
      "description": "Interactive app with API data",
      "dialogDescription": "Interactive Pokédex app with live API data. Displays names, types and images – filterable and searchable."
    },
    "elpollo": {
      "title": "El Pollo Loco",
      "description": "Gaming with OOP",
      "dialogDescription": "Jump, run and throw game with object-oriented programming. Help Pepe collect coins and hot sauce to defeat the crazy chicken."
    },
    "portfolio": {
      "title": "Portfolio",
      "description": "UI design & animation",
      "dialogDescription": "Personal portfolio focused on UI design and smooth animations. Structure, style and motion ensure a clear user experience."
    }
  },
  "footer": {
    "copyright": "© Code & Design by Jonathan Michutta 2025",
    "imprint": "Imprint",
    "privacy": "Privacy Policy",
    "copied": "Copied",
    "email": "front-dev@jonathan-michutta.de",
    "copyAria": "Copy email"
  },
  "landing": {
    "title": "Frontend Developer",
    "subtitle": "& Media Designer",
    "copied": "Copied",
    "copyAria": "Copy email",
    "copyTooltip": "Copy e-mail address"
  },
  "tools-alt-landing": {
    "api": {
      "alt": "API – Interface programming"
    },
    "javascript": {
      "alt": "JavaScript – Web development programming language"
    },
    "html": {
      "alt": "HTML – Structuring web page content"
    },
    "git": {
      "alt": "Git – Version control system for code"
    },
    "scrum": {
      "alt": "Scrum – Agile project management framework"
    },
    "css": {
      "alt": "CSS – Styling and layout of websites"
    },
    "typescript": {
      "alt": "TypeScript – Typed extension of JavaScript"
    },
    "firebase": {
      "alt": "Firebase – Backend platform by Google"
    },
    "angular": {
      "alt": "Angular – Web framework for frontend applications"
    },
    "material": {
      "alt": "Material Design – Design system by Google"
    },
    "school": {
      "alt": "Learning – Continuing education and fundamentals"
    },
    "oop": {
      "alt": "OOP – Object-oriented programming principles"
    },
    "react": {
      "alt": "React – JavaScript library for building user interfaces"
    },
    "vue": {
      "alt": "Vue.js – Progressive JavaScript framework"
    },
    "figma": {
      "alt": "Figma – Interface design and prototyping tool"
    },
    "photoshop": {
      "alt": "Photoshop – Image editing and compositing"
    },
    "illustrator": {
      "alt": "Illustrator – Vector graphics and illustrations"
    },
    "indesign": {
      "alt": "InDesign – Layout and publishing software"
    }
  },
  "links": {
    "github": "Visit my GitHub profile",
    "mail": "Send me an email",
    "linkedin": "Open my LinkedIn profile"
  },
  "dialog": {
    "alt": {
      "close": "Close dialog",
      "previous": "Previous project",
      "next": "Next project",
      "github": "GitHub link for project",
      "icon": "Icon for project {{project}}",
      "live": "Open live demo of project"
    }
  }
}